addons/l10n_ro_edi/tests/test_files/from_odoo/ciusro_in_invoice.xml

<?xml version="1.0" encoding="UTF-8"?>
<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2">
  <cbc:CustomizationID>urn:cen.eu:en16931:2017#compliant#urn:efactura.mfinante.ro:CIUS-RO:1.0.1</cbc:CustomizationID>
  <cbc:ProfileID>urn:fdc:peppol.eu:2017:poacc:billing:01:1.0</cbc:ProfileID>
  <cbc:ID>INV/2025/00006</cbc:ID>
  <cbc:IssueDate>2017-01-01</cbc:IssueDate>
  <cbc:DueDate>2017-01-31</cbc:DueDate>
  <cbc:InvoiceTypeCode>380</cbc:InvoiceTypeCode>
  <cbc:DocumentCurrencyCode>RON</cbc:DocumentCurrencyCode>
  <cbc:TaxCurrencyCode>RON</cbc:TaxCurrencyCode>
  <cac:OrderReference>
    <cbc:ID>INV/2025/00006</cbc:ID>
  </cac:OrderReference>
  <cac:AccountingSupplierParty>
    <cac:Party>
      <cbc:EndpointID schemeID="9947">8001011234567</cbc:EndpointID>
      <cac:PartyName>
        <cbc:Name>Romanian Coffee</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>Roast Bean, 4</cbc:StreetName>
        <cbc:CityName>SECTOR2</cbc:CityName>
        <cbc:PostalZone>010101</cbc:PostalZone>
        <cbc:CountrySubentity>RO-VS</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>RO</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>8001011234567</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>Romanian Coffee</cbc:RegistrationName>
        <cbc:CompanyID>8001011234567</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>Romanian Coffee</cbc:Name>
        <cbc:Telephone>+40 111 222 333</cbc:Telephone>
        <cbc:ElectronicMail>RoastedB@company.roexample.com</cbc:ElectronicMail>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingSupplierParty>
  <cac:AccountingCustomerParty>
    <cac:Party>
      <cbc:EndpointID schemeID="9947">RO1234567897</cbc:EndpointID>
      <cac:PartyName>
        <cbc:Name>Hudson Construction</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>Strada Kunst, 3</cbc:StreetName>
        <cbc:CityName>SECTOR1</cbc:CityName>
        <cbc:PostalZone>010101</cbc:PostalZone>
        <cbc:CountrySubentity>RO-VS</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>RO</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>RO1234567897</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>Hudson Construction</cbc:RegistrationName>
        <cbc:CompanyID>RO1234567897</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>Hudson Construction</cbc:Name>
        <cbc:Telephone>+40 123 456 789</cbc:Telephone>
        <cbc:ElectronicMail>HudsonC@company.roexample.com</cbc:ElectronicMail>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingCustomerParty>
  <cac:Delivery>
    <cac:DeliveryLocation>
      <cac:Address>
        <cbc:StreetName>Strada Kunst, 3</cbc:StreetName>
        <cbc:CityName>SECTOR1</cbc:CityName>
        <cbc:PostalZone>010101</cbc:PostalZone>
        <cbc:CountrySubentity>RO-VS</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>RO</cbc:IdentificationCode>
        </cac:Country>
      </cac:Address>
    </cac:DeliveryLocation>
  </cac:Delivery>
  <cac:PaymentMeans>
    <cbc:PaymentMeansCode name="credit transfer">30</cbc:PaymentMeansCode>
    <cbc:PaymentID>INV/2025/00006</cbc:PaymentID>
    <cac:PayeeFinancialAccount>
      <cbc:ID>RO23PORL7165378476876732</cbc:ID>
    </cac:PayeeFinancialAccount>
  </cac:PaymentMeans>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="RON">285</cbc:TaxAmount>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="RON">1500.00</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="RON">285</cbc:TaxAmount>
      <cac:TaxCategory>
        <cbc:ID>S</cbc:ID>
        <cbc:Percent>19.0</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
  </cac:TaxTotal>
  <cac:LegalMonetaryTotal>
    <cbc:LineExtensionAmount currencyID="RON">1500.00</cbc:LineExtensionAmount>
    <cbc:TaxExclusiveAmount currencyID="RON">1500.00</cbc:TaxExclusiveAmount>
    <cbc:TaxInclusiveAmount currencyID="RON">1785.0</cbc:TaxInclusiveAmount>
    <cbc:PrepaidAmount currencyID="RON">0.00</cbc:PrepaidAmount>
    <cbc:PayableAmount currencyID="RON">1785.0</cbc:PayableAmount>
  </cac:LegalMonetaryTotal>
  <cac:InvoiceLine>
    <cbc:ID>1</cbc:ID>
    <cbc:InvoicedQuantity unitCode="C62">2.0</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="RON">1500.00</cbc:LineExtensionAmount>
    <cac:Item>
      <cbc:Description>[DESK0005] Customizable Desk (Custom, White), 160x80cm, with large legs.</cbc:Description>
      <cbc:Name>Customizable Desk</cbc:Name>
      <cac:SellersItemIdentification>
        <cbc:ID>DESK0005</cbc:ID>
      </cac:SellersItemIdentification>
      <cac:ClassifiedTaxCategory>
        <cbc:ID>S</cbc:ID>
        <cbc:Percent>19.0</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>VAT</cbc:ID>
        </cac:TaxScheme>
      </cac:ClassifiedTaxCategory>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="RON">750.0</cbc:PriceAmount>
    </cac:Price>
  </cac:InvoiceLine>
</Invoice>
